rusttick/SplitHoverEsc/mm27/MM32SPIN2x.svd
				<register>
					<name>STA_EXT</name>
					<displayName>STA_EXT</displayName>
					<description>Extended status register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>BKP</name>
			<description>Backup registers</description>
			<groupName>BKP</groupName>
			<baseAddress>0x4000280C</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x3F0</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR1</name>
					<displayName>DR1</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR2</name>
					<displayName>DR2</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR3</name>
					<displayName>DR3</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR4</name>
					<displayName>DR4</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR5</name>
					<displayName>DR5</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR6</name>
					<displayName>DR6</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR7</name>
					<displayName>DR7</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR8</name>
					<displayName>DR8</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR9</name>
					<displayName>DR9</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR10</name>
					<displayName>DR10</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR11</name>
					<displayName>DR11</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR12</name>
					<displayName>DR12</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR13</name>
					<displayName>DR13</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR14</name>
					<displayName>DR14</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR15</name>
					<displayName>DR15</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR16</name>
					<displayName>DR16</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR17</name>
					<displayName>DR17</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR18</name>
					<displayName>DR18</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR19</name>
					<displayName>DR19</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x4c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR20</name>
					<displayName>DR20</displayName>
					<description>Backup data register(BKP_DR)</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>D</name>
							<description>Backup data</description>
						</field>
					</fields>
				</register>
