rusttick/SplitHoverEsc/mm27/MM32SPIN2x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP</name>
			<description>comparator</description>
			<groupName>COMP</groupName>
			<baseAddress>0x40013C00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>COMP_1_2_3_4_5</name>
				<description>comparator</description>
				<value>24</value>
			</interrupt>
			<registers>
				<register>
					<name>COMP4_CSR</name>
					<displayName>COMP4_CSR</displayName>
					<description>COMP4_CSR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 4 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 4 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator 4 output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 4 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 4 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 4 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP</name>
							<description>Comparator 4 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INM</name>
							<description>Comparator 4 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 4 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 4 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP5_CSR</name>
					<displayName>COMP5_CSR</displayName>
					<description>COMP5_CSR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 5 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 5 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator 5 output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 5 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 5 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 5 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>INP</name>
							<description>Comparator 5 normal phase input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>INM</name>
							<description>Comparator 5 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 5 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 5 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP1_CSR</name>
					<displayName>COMP1_CSR</displayName>
					<description>COMP1_CSR</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 1 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 1 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator 1 output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 1 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 1 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 1 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 1 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP2_CSR</name>
					<displayName>COMP2_CSR</displayName>
					<description>COMP2_CSR</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 2 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 2 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator 2 output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 2 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 2 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT</name>
							<description>Comparator 2 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 2 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 2 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP3_CSR</name>
					<displayName>COMP3_CSR</displayName>
					<description>COMP3_CSR</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Comparator 3 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STA</name>
							<description>Comparator 3 output status</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFLT</name>
							<description>Comparator 3 output filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HYST</name>
							<description>Comparator 3 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>POL</name>
							<description>Comparator 3 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUT_SEL</name>
							<description>Comparator 3 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>Comparator 3 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 3 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP_CRV</name>
					<displayName>COMP_CRV</displayName>
					<description>COMP_CRV</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>CRV_SRC</name>
							<description>Comparator external refer-ence voltage source select</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator external referencevoltage enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRV_SEL</name>
							<description>Comparator external referencevoltage select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP4_POLL</name>
					<displayName>COMP4_POLL</displayName>
					<description>COMP4_POLL</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>POUT</name>
							<description>Comparator 4 Polling output</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PERIOD</name>
							<description>Comparator 4 polling wait cycle</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>FIXN</name>
							<description>Comparator 4 Polling inverting input fix</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>Comparator 4 polling channel</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 4 polling enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP5_POLL</name>
					<displayName>COMP5_POLL</displayName>
					<description>COMP5_POLL</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>POUT</name>
							<description>Comparator 5 Polling output</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PERIOD</name>
							<description>Comparator 5 polling wait cycle</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>FIXN</name>
							<description>Comparator 5 Polling inverting input fix</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>Comparator 5 polling channel</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Comparator 5 polling enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
