rusttick/SplitHoverEsc/mm27/MM32SPIN2x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description>
			<groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DR</name>
							<description>Data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>Independent data register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>IDR</name>
							<description>General-purpose 8-bit data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RESET</name>
							<description>CRC reset</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DBG</name>
			<description>Debug support</description>
			<groupName>DBG</groupName>
			<baseAddress>0x40013400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>IDCODE</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DEV_ID</name>
							<description>Device identifier</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBG_TIMx_STOP</name>
							<description>TIMx counter stopped when core is halted</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DBG_WWDG_STOP</name>
							<description>Debug window watchdog when core is halted</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_IWDG_STOP</name>
							<description>Debug independent watchdog stopped when core is stopped</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STANDBY</name>
							<description>Debug Standby mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP</name>
							<description>Debug Stop mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_SLEEP</name>
							<description>Debug Sleep mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DIV</name>
			<description>Hardware divider</description>
			<groupName>DIV</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>HWDIV</name>
				<description>HWDIV global interrupt</description>
				<value>8</value>
			</interrupt>
			<registers>
				<register>
					<name>DVDR</name>
					<displayName>DVDR</displayName>
					<description>DVDR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DIVIDEND</name>
							<description>Dividend data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DVSR</name>
					<displayName>DVSR</displayName>
					<description>DVSR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DIVISOR</name>
							<description>Divisor data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>QUOTR</name>
					<displayName>QUOTR</displayName>
					<description>QUOTR</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>QUOTIENT</name>
							<description>Quotient data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RMDR</name>
					<displayName>RMDR</displayName>
					<description>RMDR</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>REMAINDER</name>
							<description>Remainder data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>SR</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>OVF</name>
							<description>Overflow flag</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>OVFE</name>
							<description>Overflow interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USIGN</name>
							<description>unsigned enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
