rusttick/SplitHoverEsc/mm27/MM32SPIN2x.svd
				<register>
					<name>SETUP</name>
					<displayName>SETUP</displayName>
					<description>SDA Setup Time Register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0064</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>CNT</name>
							<description>SDA setup</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<displayName>GCR</displayName>
					<description>ACK General Call Register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>GC</name>
							<description>ACK general call</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>IWDG</name>
			<description>Independent watchdog</description>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KR</name>
					<displayName>KR</displayName>
					<description>Key register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>KEY</name>
							<description>Key value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Prescaler register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<name>PR</name>
							<description>Prescaler divider</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RLR</name>
					<displayName>RLR</displayName>
					<description>Reload register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<name>RL</name>
							<description>Watchdog counter reload value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>RVU</name>
							<description>Watchdog counter reload value update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVU</name>
							<description>Watchdog prescaler value update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ_CLR</name>
							<description>Interruput clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IRQ_SEL</name>
							<description>Interruput select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>OPAMP</name>
			<description>Operational Amplifier</description>
			<groupName>OPAMP</groupName>
			<baseAddress>0x40013C10</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OPAMP_CSR</name>
					<displayName>OPAMP_CSR</displayName>
					<description>OPAMP_CSR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>OPAMP4_EN</name>
							<description>operational amplifier 4 enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPAMP3_EN</name>
							<description>operational amplifier 3 enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPAMP2_EN</name>
							<description>operational amplifier 2 enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPAMP1_EN</name>
							<description>operational amplifier 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PWM</name>
			<description>PWM Control</description>
			<groupName>PWM</groupName>
			<baseAddress>0x40016400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PWM</name>
				<description>Commutation and Input Interrupt</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Control PWM output status register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>MSKEN_CURR</name>
							<description>PWM Output Mask Immediately Enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>MSKDAT</name>
							<description>Immediate Output of The Port when PWM is Masked</description>
							<bitOffset>19</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CUREN</name>
							<description>Enable Current Input Status Value</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALL_TRGSEL</name>
							<description>Hall Sensor Trigger 3-channel select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IOFLT</name>
							<description>GPIO Input Filter</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>TERRIF</name>
							<description>Trigger Error Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>APMTIF</name>
							<description>Auto Phase Mask Trigger Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CP_MDSEL</name>
							<description>Current Protection Mode Selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC_STRG</name>
							<description>Current Compensation Software Trigger</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC_TRGSEL</name>
							<description>Current Protection Trigger Selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>TERRIE</name>
							<description>Trigger Error Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>APMTIE</name>
							<description>Auto Phase Mask Trigger Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPE</name>
							<description>Current Protection Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCE</name>
							<description>Current Compensation Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CP_TRGSEL</name>
							<description>Current Protection Trigger Selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APMSKR</name>
					<displayName>APMSKR</displayName>
					<description>Auto phase mask register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CTRGI</name>
							<description>Current Trigger Input</description>
							<bitOffset>23</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ENTRGI</name>
							<description>Expect Next Trigger Input</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>APM_STRG</name>
							<description>Auto Phase Mask Software Trigger</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>APM_TRIGSEL</name>
							<description>Auto Phase Mask Tigger Selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSKEN</name>
							<description>PWM Mask Function Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>MSKDAT</name>
							<description>PWM Mask Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APMDLR</name>
					<displayName>APMDLR</displayName>
					<description>Auto phase mask dalay register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>26</bitWidth>
							<name>APMDLR</name>
							<description>*D0</description>
						</field>
					</fields>
				</register>
